[
  {
    "img": "macaroon.gif",
    "title": "Macarron",
    "subTitle": "팀 프로젝트",
    "description": "소비자의 취향에 맞는 브랜드 아이템을 선별하여 판매하는 편집샵 쇼핑몰 프로젝트 입니다. ",
    "mainInfo": "팀원들과 노션으로 일정 관리를 하며 노션을 사용한 팀 협업 방식에 대해서 배울 수 있었고, git 스터디를 진행하며 git 명령어와 git commit 컨벤션에 대해서도 배울 수 있었다. 매주 수요일마다 서로 공부한 내용과 각자 맡은 기능 구현 진행 상황을 공유했는데 팀 프로젝트를 할 때 가장 중요한 것 중 하나가 서로 진행상황 및 막히는 부분에 대한 공유라는 것을 알게 되었다. 또 유저 인터페이스를 고민하며 화면 디자인을 기획하고 개발했는데 이 과정에서 팀원들의 피드백을 받을 수 있었고 그로 인해 많이 배울 수 있었다. 부트스트랩을 통해 반응형 웹을 만들 때  화면의 크기마다 페이지의 아이템들을 어떻게 보이게 할 건지 고민하는 과정 또한 재미있었다. 아쉬웠던 점은 사용 기술을 선택할 때 내가 스스로 고민해서 선택한게 아닌, 미리 제시된 기술들을 사용해 개발을했던 점이 조금 아쉬웠다.",
    "stackInfo": "Java • Jsp  • JavaScrpt  • HTML  • CSS • Oracle",
    "link": "https://github.com/ChohyePark/macaroonProject"
  },
  {
    "img": "magazine.gif",
    "title": "방구석 매거진",
    "subTitle": "팀 프로젝트",
    "description": "한 분야에 과몰입한 디깅러들이 서로의 관심 분야와 취향을 공유하는 매거진 프로젝트입니다.",
    "mainInfo": "사용하고 싶었던 기술인 리액트를 채택해서 개인적으로 프로젝트 과정 내내 즐거웠다. 리액트를 선택한 이유는 컴포넌트 기반 아키텍처로 코드를 작은 조각으로 나누고 그 조각을 재사용 함으로써 유지 보수가 편하다는 장점이 있고 사용자 커뮤니티가 활성화되어 있어서 정보를 얻기 편리해서 선택했다. 프로젝트 진행 중 어려웠던 부분은 서버에서 작성 글 카테고리를 영어로 보내면 그걸 다시 한글로 변환 한 뒤 보이게 하는 부분이 어려웠다. 이 부분은 필터와 맵을 사용한 convertToKorean 함수를 따로 만들어서 해결했다. 사용자 페르소나가 젊은 층이어서 인터랙티브한 웹을 만들기 위해 aos 라이브러리를 활용했으며 라이브러리 사용법이 간단해서 빠르게 적용할 수 있었다. 아쉬웠던 점은 scss를 사용하려고 했지만 학습이 덜 되어서 사용하지 못했던 점이 아쉬웠다.",
    "stackInfo": "SpringBoot • JPA • MySQL • Gradle • JavaScript • React",
    "link": "https://github.com/ChohyePark/magazineProject"
  },
  {
    "img": "tottle.gif",
    "title": "Tottle",
    "subTitle": "팀 프로젝트",
    "description": "이글루 클라우드 회사의 요구사항에 맞춰 기업 사이트의 기능과 ui를 개편한 프로젝트 입니다.",
    "mainInfo": "팀원들과 공통 styles scss를 만들어서 사용해서 scss 모듈화를 경험하고 배울 수 있었다. github 프로젝트 칸반을 활용하여 프로젝트 진행 상황을 실시간으로 공유하고 매일 오전 디스코드에서 진행한 스크럼 회의 시간에 서로 부족한 부분을 도와줘서 프로젝트가 원활하게 진행될 수 있었던 것 같다. 그전에는 부트스트랩을 통해 반응형 웹을 개발했는데, 이번에는 미디어 쿼리와 플렉스 박스를 이용해 반응형 웹을 개발해서 미디어 쿼리, 플렉스 박스 동작 원리를 이해할 수 있었다. 조금 아쉬운 부분이 있다면 리액트에서 팀원들끼리 공통 컴포넌트를 공유하는 부분이 없어서 아쉬웠다. 마지막으로 팀원의 코드 리뷰를 받고 리뷰 내용을 다시 코드에 반영하는 과정에서 스스로 많이 성장한 것 같다.",
    "stackInfo": "Ract • JavaScript • SCSS ",
    "link": "https://github.com/e-glue/totle"
  },
  {
    "img": "portfolio.png",
    "title": "Portfolio",
    "subTitle": "개인 프로젝트",
    "description": "개인 포트폴리오 프로젝트입니다. ",
    "mainInfo": "사이트 디자인부터 기술 선택, 라이브러리 선택까지 모두 혼자 결정하는 프로젝트는 처음이었다. 내가 잘못하고 있는 건 아닌지 스스로 계속 의심하고 질문을 던졌다. 그로 인해 많이 성장할 수 있었지만 과정 내내 혼란스러웠다. 한 페이지에 있는 각각의 섹션을 컴포넌트로 분리하고 fullpage에서 모든 컴포넌트를 조립하는 방식으로 개발을 진행했다. 그리고 서버가 없기 때문에 mock 폴더에 json 데이터를 만들어서 이를 활용했다. 이번 프로젝트에서는 aos 같은 애니메이션 라이브러리가 아닌 옵저버와 scss를 활용해서 애니메이션 효과를 주었는데 덕분에 옵저버 활용에 능숙해질 수 있었다.",
    "stackInfo": "React • JavaScript • SCSS ",
    "link": "https://github.com/ChohyePark/portfolio"
  }
]
